app/views/songs/index.html.erb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
---
<% @songs.each do |song| %>
  <% if songs.artist.present? %>