app/views/songs/index.html.erb

SELECT "songs".* FROM "songs"
---
<ul>
<% @artist.songs.each do |song| %>